Revit 2027 API
ParameterTypeId.ImportAdtEntityStructType Property
 "Structural Type Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ImportAdtEntityStructType { get; }
Public Shared ReadOnly Property ImportAdtEntityStructType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ImportAdtEntityStructType {
	ForgeTypeId^ get ();
}
static member ImportAdtEntityStructType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace